---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarPropagation
source: html/4cb3a78e-f9e0-e16a-2be8-2265dcfbdf7b.htm
---
# RebarPropagation Methods

It will copy the source rebars, will align them to the destination face based on the source face and adapt them to destination host.